examples/flows/compiled/if_one_empty_branch/flow.mmd
flowchart TD
    %% Flow: if_one_empty_branch

    handler_finalize[handler_finalize]
    handler_process[handler_process]
    handler_setup[handler_setup]
    router_if_empty_branches_flow_line_14_if_1{{router_if_empty_branches_flow_line_14_if_1}}
    start_if_empty_branches_flow([start_if_empty_branches_flow])
    __end__((( )))

    start_if_empty_branches_flow --> handler_setup
    handler_setup --> router_if_empty_branches_flow_line_14_if_1
    router_if_empty_branches_flow_line_14_if_1 -->|p['skip_processing']| handler_finalize
    router_if_empty_branches_flow_line_14_if_1 -->|not (p['skip_processing'])| handler_process
    handler_process --> handler_finalize
    handler_finalize --> __end__
